benchmark_results/perfil2_media_20251030_040638.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /isprime?n=97
Document Length:        68 bytes

Concurrency Level:      50
Time taken for tests:   0.060 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      109000 bytes
HTML transferred:       34000 bytes
Requests per second:    8402.09 [#/sec] (mean)
Time per request:       5.951 [ms] (mean)
Time per request:       0.119 [ms] (mean, across all concurrent requests)
Transfer rate:          1788.73 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   0.4      2       3
Processing:     1    3   0.8      3       7
Waiting:        0    2   0.7      2       5
Total:          2    6   0.9      6       9

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      6
  75%      6
  80%      6
  90%      7
  95%      7
  98%      8
  99%      8
 100%      9 (longest request)